[Option]
Option=0
CtrlCnt=24
InfoCnt=87
4=S_Chinese
9=English
31748=T_Chinese

[S_Chinese_Info]
Info000=启动量产功能前请不要插入设备!\n请拔出设备!
Info001=不要在工作中插拔hub!可能导致量产系统崩溃!\n请将该批设备断电后重新量产!
Info002=必须在绿灯的时候才能插入新设备!\n请重新启动软件,并重新量产当前连接的所有设备!
Info003=PnpFelIn:非法ID
Info004=尚有量产任务在进行,无法停止!
Info005=错误，请检查dram配置!
Info006=错误，请检查fes!
Info007=错误，注册失败
Info008=错误，新软件包不满足升级条件
Info009=设备
Info010=类型
Info011=ID
Info012=进度
Info013=结果
Info014=成功 
Info015=失败
Info016=启动
Info017=停止
Info018=名称
Info019=前缀(十六进制)
Info020=自动累加(十六进制)
Info021=后缀(十六进制)
Info022=设备列表
Info023=请必须选择固件文件
Info024=请必须选择认证文件
Info025=现在可以插入设备了
Info026=请等变绿灯后才插入设备
Info027=动态数据配置
Info028=完成
Info029=警告
Info030=错误
Info031=设备连接中，禁止停止操作
Info032=启动失败，错误号(%d)
Info033=停止败，错误号(%d)
Info034=检测失败
Info035=打开固件包失败
Info036=关闭固件包失败
Info037=打开USB设备失败
Info038=初始化MBR失败
Info039=存储介质扫描失败
Info040=烧写boot0失败 
Info041=烧写boot1失败 
Info042=烧写fed失败
Info043=烧写分区镜像失败
Info044=烧写失败4
Info045=创建SPM失败 
Info046=烧写SPM失败
Info047=烧写MBR失败
Info048=烧写失败8
Info049=烧写量产结束标识符失败
Info050=保留
Info051=系统复位失败
Info052=存储设备扫描
Info053=下载运行Fed
Info054=正在下载分区0
Info055=正在下载分区1
Info056=正在下载分区2
Info057=正在下载分区3
Info058=正在下载分区4
Info059=正在下载分区5
Info060=正在下载MBR
Info061=正在升级boot0\boot1
Info062=1.如使用Hub,软件运行前安装好Hub，且不要接入任何待量产的设备!量产中途不要插拔Hub,不要更换Hub接入口!
Info063=2.选择固件img文件，然后"启动"量产系统!
Info064=3.当绿灯亮时插入一个新设备!红灯亮时不要插入新设备!
Info065=4.不要拔出正在量产的设备!根据ID拔出完成及失败的设备!设备不要重复量产!
Info066=完成，正在复位...
Info067=正在下载分区6
Info068=正在下载分区7
Info069=正在下载分区8
Info070=正在下载分区9
Info071=正在下载分区10
Info072=正在下载分区11
Info073=关闭USB设备失败
Info074=生成私有数据失败
Info075=读取私有数据配置失败
Info076=烧写私有数据
Info077=序列号:
Info078=状  态:
Info079=进  度:
Info080=设备
Info081=最大允许8个设备同时工作!
Info082=系统识别到USB口有变化,需要重新标记USB端口\n选择"是"重新标记,"否"忽略该设备\r\n(选择"是"前必须拔出其他所有设备)
Info083=空板烧录请勿勾选，接上电池烧录必须勾选
Info084=擦除普通分区数据，同时擦除所有Key数据，慎用！！！
Info085=配合U-Boot对应的功能配置可实现设备启动时自动跳Fel
Info086=烧录完成后断开USB连接时清除对应设备信息
[English_Info]
Info000=Don't connect the device before starting production function!\nPlease disconnect the device!
Info001=Please don't disconnect the hub when the production is processing! This behavior may cause the production system crash!\nPlease reproduce the equipment after power off.
Info002=Must connect the new device when the green light!\nPlease restart the software, and re-produce all device currently connected!
Info003=PnpFelIn: illegal ID!
Info004=There are tasks during production!
Info005=Please check the dram setting!
Info006=Please check the fes!
Info007=Registration failed!
Info008=New upgrade package does not meet the conditions!
Info009=Device
Info010=Type
Info011=ID
Info012=Progress rate
Info013=Result
Info014=Success
Info015=Failure
Info016=Start
Info017=Stop
Info018=Name
Info019=Prefix(Hexadecimal)
Info020=Auto-increment(Hexadecimal)
Info021=Suffix(Hexadecimal)
Info022=Device List
Info023=You must select a image file.
Info024=You must select a key file.
Info025=You can plugin the device
Info026=You can't plugin the device
Info027= Dynamic Data Setting
Info028=Finish
Info029=Warning
Info030=Error
Info031=Device Connecting.
Info032=Start Failed. Error No.(%d)
Info033=Stop Failed. Error No.(%d)
Info034=Scan Failed
Info035=Open FW Failed
Info036=Close FW Failed
Info037=Open USB device Failed
Info038=Create MBR Failed
Info039=Hardware Failed1
Info040=Download boot0 Failed 
Info041=Download boot1 Failed 
Info042=Download fed_nand Failed
Info043=Download rootfs Failed
Info044=Download Failed 4
Info045=Create SPM Failed 
Info046=Download SPM Failed
Info047=Download MBR Failed
Info048=Download Failed8
Info049=Download End Flag Failed
Info050=Reserve
Info051=Reset System Failed
Info052=storage media scan
Info053=down and run fed
Info054=down download0
Info055=down download1
Info056=down download1
Info057=down download1
Info058=down download1
Info059=down download1
Info060=down MBR
Info061=down update boot0/boot1
Info062=1.Install the USB Hub before run the starg. And Could't Plugin any device and Hub!
Info063=2.Select the key file and image file, Then start
Info064=3.When the light turn green, please plugin a new device. Don't plugin a device when the light turn read 
Info065=4.Don't Plug out any device when it in processing state. You can plug out any deivce Accord to the ID of device
Info066=Finish and reseting system...
Info067=down download6
Info068=down download7
Info069=down download8
Info070=down download9
Info071=down download10
Info072=down download11
Info073=Close USB Device Failed
Info074=Create private data failed
Info075=Load Private config failed
Info076=Burn Private Data
Info077=Serial:
Info078=Status:
Info079=Progress:
Info080=Device
Info081=Maximum allowed eight devices at the same time work!
Info082=USB port have change, you need to tag USB port \n choice "YES" to mark, "NO" to ignore the device \r \n (MUST pull out all the other equipment before  select "YES")
Info083=Don't check for PCBA board without battery. Check required with battery
Info084=Erase normal partition data and all Key data at the same time, use with caution! ! !
Info085=Cooperate with U-Boot corresponding functional configuration to automatically jump Fel when the device starts
Info086=Clear the corresponding device information when the USB connection is disconnected after the burning is completed
[T_Chinese_Info]
Info000=啟動量產功能前請不要插入設備！\n請拔出設備！
Info001=不要在工作中插拔Hub！可能導致量產系統崩潰！\n請將該批設備斷電後重新量產！
Info002=必須在綠燈的時候才能插入新設備!\n請重新啟動軟件,並重新量產當前連接的所有設備!
Info003=PnpFelIn:非法ID
Info004=尚有量產任務在進行!
Info005=請檢查dram配置!
Info006=請檢查fes!
Info007=註冊失敗
Info008=新軟件包不滿足升級條件
Info009=設備
Info010=類型
Info011=ID
Info012=進度
Info013=結果
Info014=成功 
Info015=失敗
Info016=啟動
Info017=停止
Info019=首碼(十六進位)
Info020=自動累加(十六進位)
Info021=後綴(十六進位)
Info022=設備列表
Info023=請必須選擇固件文件
Info024=請必須選擇認證文件
Info025=現在可以插入設備了
Info026=請等變綠燈後再插入設備
Info027=動態數據配置
Info028=完成
Info029=警告
Info030=錯誤
Info031=設備連接中，精緻停止操作
Info032=啟動失敗，錯誤號(%d)
Info033=停止失敗，錯誤號(%d)
Info034=檢測失敗
Info035=打開固件包失敗
Info036=關閉固件包失敗
Info037=打開USB設備失敗
Info038=創建MBR失敗
Info039=存儲介質
Info040=燒寫boot0失敗 
Info041=燒寫boot1失敗 
Info042=燒寫fed_nand失敗
Info043=燒寫rootfs失敗
Info044=燒寫失敗4
Info045=創建SPM失敗 
Info046=燒寫SPM失敗
Info047=燒寫MBR失敗
Info048=燒寫失敗8
Info049=燒寫量產結束標識失敗
Info050=保留
Info051=系統復位失敗
Info052=存储设备扫描
Info053=正在下載運行Fed
Info054=正在下載0
Info055=正在下載1
Info056=正在下載2
Info057=正在下載3
Info058=正在下載4
Info059=正在下載5
Info060=正在下載MBR
Info061=正在升級boot0\boot1
Info062=1.如使用Hub,軟件運行前安裝好Hub，且不要接入任何待量產的設備!量產中途不要插拔Hub,不要更換Hub接入口!
Info063=2.選擇固件img文件，然後"啟動"量產系統!
Info064=3.當綠燈亮時插入一個新設備!紅燈亮時不要插入新設備!
Info065=4.不要拔出正在量產的設備!根據ID拔出完成及失敗的設備!設備不要重複量產!
Info066=完成，正在復位系統
Info067=正在下載6
Info068=正在下載7
Info069=正在下載8
Info070=正在下載9
Info071=正在下載10
Info072=正在下載11
Info073=關閉USB設備失敗
Info074=生成私有數據失敗
Info075=讀取私有數據配置失敗
Info076=燒寫私有數據
Info077=序列號:
Info078=狀  態:
Info079=進  度:
Info080=設備
Info081=最大允許8個設備同時工作!
Info082=系統識別到USB口有變化,需要重新標記USB端口\n選擇"是"重新標記,"否"忽略該設備\r\n(選擇"是"前必須拔出其他所有設備)
Info083=空板燒錄請勿勾選，接上電池燒錄必須勾選
Info084=擦除普通分區數據，同時擦除所有Key數據，慎用！！！
Info085=配合U-Boot對應的功能配置可實現設備啟動時自動跳Fel
Info086=燒錄完成後斷開USB連接時清除對應設備信息
;// 以下是控件字符串

;#define IDC_START                       1006
;#define IDC_IMG_FILE                    1008
;#define IDC_KEY_FILE                    1009
;#define IDC_EXIT                        1010
;#define IDC_DYNAMIC_STATIC              1015
;#define IDC_SOFT_HELP                   1016
;#define IDC_SCUESS_STATIC               1020
;#define IDC_FAILED_STATIC               1021
;#define IDC_TOTAL_STATIC                1022
;#define IDC_CALC_STATIC                 1023
;#define IDC_WIZARD                      1027
;#define IDC_KEY_STATIC                   1029
;#define IDC_IMAGE_STATIC                 1030

[S_Chinese_Ctrl]
ctrl000=启动
ctrl001=固件包
ctrl002=认证文件
ctrl003=退出
ctrl004=动态数据
ctrl005=帮助
ctrl006=成功次数
ctrl007=失败次数
ctrl008=总次数
ctrl009=统计信息
ctrl010=开始向导
ctrl011=固件包
ctrl012=认证文件
ctrl013=关闭
ctrl014=快速指南
ctrl015=版本检测
ctrl016=烧完重启(空板烧录请勿勾选，接上电池烧录必须勾选)
ctrl017=格式化
ctrl018=调试信息
ctrl019=全盘擦除
ctrl020=二次升级
ctrl021=烧录完成拔出usb清除信息
ctrl022=烧录模式！！！
ctrl023=擦号模式！！！

[T_Chinese_Ctrl]
ctrl000=啟動
ctrl001=固件
ctrl002=認證文件
ctrl003=退出
ctrl004=動態數據
ctrl005=幫助
ctrl006=成功次數
ctrl007=失敗次數
ctrl008=總次數
ctrl009=統計信息
ctrl010=開始嚮導
ctrl011=固件
ctrl012=認證文件
ctrl013=關閉
ctrl014=快速指南
ctrl015=版本檢測
ctrl016=燒完重啓(空板燒錄請勿勾選，接上電池燒錄必須勾選)
ctrl017=格式化
ctrl018=調試信息
ctrl019=全盤擦除
ctrl020=二次陞級
ctrl021=燒錄完成拔出usb清除資訊、
ctrl022=燒錄模式！！！
ctrl023=擦號模式！！！

[English_Ctrl]
ctrl000=Start
ctrl001=Image
ctrl002=Key File
ctrl003=Exit
ctrl004=Dynamic Data
ctrl005=Help
ctrl006=Scuess
ctrl007=Failed
ctrl008=Total
ctrl009=Statistics
ctrl010=Begin Wizard
ctrl011=Image
ctrl012=Key
ctrl013=Close
ctrl014=Easy Wizard
ctrl015=Update
ctrl016=Restart after burning (do not check the empty board burning, and check the battery burning when connected)
ctrl017=Format
ctrl018=DebugView
ctrl019=Erase all
ctrl020=Sec upgrade
ctrl021=After burning, unplug the USB to clear the information
ctrl022=Burn！！！
ctrl023=Erase！！！